# Parameter Type Id Rebar Crank Length Override Property

Source: https://www.revitapidocs.com/2026/810b043f-2739-e3dc-5177-ee1757241fc5.htm

---

| Parameter Type Id Rebar Crank Length Override Property |
| --- |

"Override Crank Lengths"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankLengthOverride { get; }
```

```
Public Shared ReadOnly Property RebarCrankLengthOverride As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankLengthOverride {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankLengthOverride : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace